{
	"title": "Timeline",
	"slug": "timeline",
	"intro": "The following puts my work experience in a narrative context. Of course, there's always the traditional résumé.",
	"section": [
		{
			"year": "2024 - present",
			"id": "present-day",
			"narrative": "<p>I am 77% through <a class='derek-pink' href='https://perpetual.education/'><em>Design for the Web</em></a> taught by <a href='https://sheriffderek.consulting/'>Derek Wood</a>. I love it.</p>",
			"skills": [
				{
					"skill": "Preparing and creating shareable rich metadata assets"
				},
				{
					"skill": "Formatting responsive, dynamic, and accessible webapges via semantic HTML, JS, CSS, and PHP"
				},
				{
					"skill": "Mapping out resilient design systems using custom properties, JSON, and PHP routing modules"
				},
				{
					"skill": "Creating webpage layouts with Figma and Affinity 2 software."
				}
			],
			"image": "images/timeline/perpetual.jpg",
			"figCaption": "Learning how to design UX/UI and develop accessible websites"
		},
		{
			"year": "2021 - 2022",
			"id": "burbank",
			"narrative": "<p>Leaving Gaithersburg, Maryland for Burbank, California, I join John Muir Middle School as an ESL / English teacher.</p>",
			"skills": [
				{
					"skill": "Created over 185 unique standards-based lesson plans"
				},
				{
					"skill": "Tracked student progress / behavior for ~100 English Language Learners"
				},
				{
					"skill": "Developed academic and behavior intervention plans alongside counselors and school psychologists"
				},
				{
					"skill": "Proctored high stakes state tests (CAASPP and ELPAC)"
				}
			],
			"image": "images/timeline/burbank.jpg",
			"figCaption": "John Muir Middle School in Burbank, California"
		},
		{
			"year": "2018 - 2021",
			"id": "white-oak",
			"narrative": "<p>Back in the United States after a Fulbright Scholarship in Taiwan, I join White Oak Middle School as an ESL / English teacher. It will be an illuminating four years.</p>",
			"skills": [
				{
					"skill": "Designed language curriculum for ELD levels 1-4 and co-taught 6th-8th ELA classes"
				},
				{
					"skill": "As required, co-taught STEM courses as ELD support teacher"
				},
				{
					"skill": "Developed academic and behavior intervention plans alongside counselors and school psychologists"
				},
				{
					"skill": "Proctored the national WIDA assessment to place incoming and current students"
				}
			],
			"image": "images/timeline/white-oak.jpg",
			"figCaption": "White Oak Middle School in White Oak, Maryland, 25 minutes from D.C."
		},
		{
			"year": "2017 - 2018",
			"id": "fulbright",
			"narrative": "<p>With my teaching master's degree fresh in hand, I board a plane to Taiwan to teach English as a Fulbright English Teaching Assistant. I travel to different elementary schools in Zhiben, a spa town in the Taitung region</p>",
			"skills": [
				{
					"skill": "Co-taught K-6 English classes alongside a certified local English teacher"
				},
				{
					"skill": "Participated in local and national government events as a cultural representative of the United States"
				},
				{
					"skill": "Recorded native prompts for the General English Proficiency Test"
				},
				{
					"skill": "Gained familiarity with Mandarin's syntax, vocabulary, and socio-linguistic behavior"
				}
			],
			"image": "images/timeline/taiwan.jpg",
			"figCaption": "Mr. Browns Road in Chihshang, Taitung, just a scooter ride away from the city."
		},
		{
			"year": "2014-2017",
			"id": "montclair",
			"narrative": "<p>After a few years in the publishing, I decided to attend Montclair State University's Teaching Program to realize my lifelong love for education. I achieved a Master's in Teaching English as a second language, only one course shy of a Master's in Linguistics due to a timing conflict with a Fulbright scholarship.</p><p>Over the summer, I intern at Educational Testing Services to research and write questions for the TOEFL internet-Based Test.</p>",
			"skills": [
				{
					"skill": "Researched, created, and revised test items for the Speaking Section of the TOEFL iBT"
				},
				{
					"skill": "Handled confidential test-taking data"
				},
				{
					"skill": "Recorded native prompts for the General English Proficiency Test"
				},
				{
					"skill": "Gained familiarity with Mandarin's syntax, vocabulary, and socio-linguistic behavior"
				}
			],
			"image": "images/timeline/montclair.jpg",
			"figCaption": "Montclair State University campus in Montclair, New Jersey"
		}
	]
}

