{
	"title": "Work & Exploration",
	"slug": "work",
	"template": "blog",
	"meta-description": "Great designers know that those “a-ha!” moments hide within the tall grass of process and practice.",
	"intro": "Great designers know that those “a-ha!” moments hide within the tall grass of process and practice. Below is a list of my four most recent writings, wonderings, and experiments. Don’t forget to check out <a href='?page=archive'>the archive</a> for more ideas.",
	"articles": [
		{
			"id": "6b7ed1c1-0f9e-48ec-b8fe-e64ba4536ee1",
			"title": "Death and Design",
			"slug": "death-and-design",
			"published": "02 NOV 2023",
			"updated": "10 NOV 2023",
			"alt": "Outline of a cartoonish skeletal arm giving a thumbs up",
			"description": "Cinema weaves sight and sound into a storytelling design sytsem.",
			"preview-image": "images/explorations/death-and-design/headline.jpg",
			"related": ["bottles-in-the-sky", "theme-challenge"],
			"case-study": [
				{
					"section": [
						{
							"module": "common-figure",
							"image": "images/explorations//death-and-design/headline.jpg",
							"alt": "Outline of a cartoonish skeletal arm giving a thumbs up",
							"headline": true
						},
						{
							"module": "generic-text-heading",
							"content": "<h2>Of Corpse!</h2><p>Yesterday, a friend recommended I check out the existential, surrealist 2016 film <a href='https://en.wikipedia.org/wiki/Swiss_Army_Man'>Swiss Army Man</a>,  insisting that there was no other piece of media more “me” than this one. Seeing that the conceit of the film revolves around the budding relationship between a potentially (most definitely) unhinged social outcast and a farting magical corpse, I was more than intrigued. Was I the idealistic protagonist Hank, burdened by the perceived “ugliness” of his physical and mental self, or was I the corpse, rediscovering the beauty and sadness of life through love, loss, and flatulence?</p><p>The answer isn’t important (spoiler alert: a bit of both). What I gleaned from the film, aside from the thrilling roller coaster of heartbreak, imagination, joy, and sobering horror, was that I couldn’t resist trying to put the film into a box. Try as I might to just enjoy the film, I had this uncontrollable urge to put a label on it. Was this film a comedy? Romance? <a href='https://en.wikipedia.org/wiki/Bildungsroman'>Bildungsroman</a>? Fantastic realist hero’s journey?</p><p>What binds this seemingly hodge-podge of genres and moods is the strength of its unifying vision, its unbreakable commitment. As laid out in this <a href='https://acelare.wordpress.com/2016/08/11/swiss-army-man-a-dead-on-analysis-of-themes-and-color-symbolism/#:~:text=His%20pants%20are%20a%20neutral,on%20unrequited%20romance%20and%20relationships.'>wonderful analysis</a>, each character had an identifiable color-palette, each character symbolized an element of Hank’s internal struggle or denied aspirations. Each character was searching for the same clearly-defined goal - acceptance.</p><p>Like Hank’s internal struggle, the film wanted to be accepted as it was, bruises and all, for what we often think is wrong about ourselves is often what makes us unique and alive.</p>"
						}		
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Life Moves On</h2><p>Regardless of how fantastical things seemed (that a corpse and a living person could become best friends), the film did not compromise its overall design; it remained anchored in the things that make humans unique.<p><em>This is the mission </em> - that I approach design with intention and humanity.</p><p>And of course, leave room for a fart joke here and there.</p>"
						}	
					]
				},
				{
					"section": [
						{
							"module": "key-takeaways",
							"takeaways": [
								{
									"teaser": "Design is more than a system",
									"description": "Intention, heart, communication - without having a clear opinion, your story or website will wander."
								},
								{
									"teaser": "Daniel Radcliffe is a phenomenal actor",
									"description": "If you haven't seen him yet in <em>Miracle Workers</em>, I highly recommend it."
								}
							]
						}
					]
				}
			]
		},
		{
			"id": "197a8b43-e7df-4809-abe2-1938f4a2cc63",
			"title": "Bottles in the Sky",
			"slug": "bottles-in-the-sky",
			"published": "03 NOV 2023",
			"updated": "10 OCT 2023",
			"alt": "Three outlines of bottles against a purple backdrop",
			"description": "There are great designs and terrible designs all around us. Nothing is permanent.",
			"preview-image": "images/explorations/bottles-in-the-sky/headline.jpg",
			"related": ["death-and-design", "theme-challenge"],
			"case-study": [
				{
					"section": [
						{
							"module": "common-figure",
							"image": "images/explorations/bottles-in-the-sky/headline.jpg",
							"alt": "Three outlines of bottles against a purple backdrop",
							"headline": true
						},
						{
							"module": "generic-text-heading",
							"content": "<h2>Introduction</h2><p>In 1948, a Nebraska farmer named Frank Zybach invented a novel irrigation system that pumped life into the desiccated Great Plains region of North America. By doing so, he unwittingly transformed the patchwork geometry of farms.</p>"
						},
						{
							"module": "figure-list",
							"double-figure": true,
							"figure": [
								{
									"image": "images/explorations/bottles-in-the-sky/square-fields.jpg",
									"figCaption": "Familiar square and rectangle farms",
									"alt": "An aerial shot of square and rectangle farm plots"
								},
								{
									"image": "images/explorations/bottles-in-the-sky/circular-fields.jpg",
									"figCaption": "Circular fields using central pivot irrigation",
									"alt": "An aerial shot of circular field plots"
								}
							]
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Agricultural Geometry</h2><p>Perhaps I’m being <a href='https://en.wikipedia.org/wiki/Apophenia'>apophonetic</a>, but as the United States was going through a cultural and industrial revolution post-WW2, so did our physical landscape transition from cubist to more abstract, curved forms.</p><p>Let me show you another aerial image. If you live in Los Angeles, it will strike fear into your heart</p>"
						},
						{
							"module": "common-figure",
							"image": "images/explorations/bottles-in-the-sky/i-110.jpg",
							"figCaption": "Southband i-110 (courtesy of Wikipedia)",
							"alt": "Traffic-filled Southbound i-110 freeway in Los Angeles"
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Changing the Landscape</h2><p>One of the worst bottle-necks in the nation - the intersection of the 110 and the 105, also known as the Judge Harry Pregerson Interchange.</p><p>Admire the tension between stasis and movement. The gossamer-thin ramps weaved over the thick freeway belt like a silk brocade. One of the few moments where you can feel yourself aging as you wait in traffic.</p><p>Is it beautiful? Is it terrifying? Is it just a road?</p><p>Here is my 8-minute Affinity 2 designed logo for the Pregerson Interchange. Enjoy.</p>"
						},
						{
							"module": "common-figure",
							"image": "images/explorations/bottles-in-the-sky/i-110-logo.jpg",
							"figCaption": "Everything should have a logo, right?",
							"alt": "Black lines branching out with a red and yellow ink slash at point of divergence"
						}
					]
				}
			]
		},
		{
			"id": "847201ff-480b-46af-98a5-4b787d84fd6c",
			"title": "Theme Challenge",
			"slug": "theme-challenge",
			"published": "17 APR 2024",
			"updated": "20 APR 2024",
			"alt": "A cartoon drawing of boxes within boxes making a web layout",
			"preview-image": "images/explorations/theme-challenge/headline.jpg",
			"description": "Given a blank canvas and a demographic, what elements do you reach for to establish connection?",
			"related": ["death-and-design", "bottles-in-the-sky"],
			"case-study": [
				{
					"section": [
						{
							"module": "common-figure",
							"image": "images/explorations/theme-challenge/headline.jpg",
							"alt": "A cartoon drawing of boxes within boxes making a web layout",
							"headline": true
						},
						{
							"module": "generic-text-heading",
							"content": "<h2>Introduction</h2><p>The goal of this project was to transform a wireframe into a professional webpage based on a chosen industry’s style conventions. The hidden challenge was to create a flexible, durable design system where the aesthetics (color, text content, module order) could be changed with only a few lines of code. The HTML should be changed <em>as little as possible</em>."
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Part 1: Research</h2><p>After brainstorming a list of 50 potential industries ranging from “offshore drilling” to “psychedelic-assisted therapy”, I settled on “landscaping” - a ubiquitous presence with dynamic demographics. I chose “luxury landscaping” with a speciality in “dry, arid climates.”</p><p>After compiling a Figma design file with screenshots of various luxury landscaping websites, I created a style tile that represented each module of the website, as well as the “visual tricks” (motifs) the websites shared to convey a “luxury” and “manicured” feel. Visual tricks included:</p><ul><li>Dark green, gold, or black buttons with an off-white background</li><li>Mostly square, sharp edges with generous padding around elements</li><li>Serif headings paired with sans-serif copy → stately with readability</li><li>Images do the talking - if there are any dividers, they should be thin lines</li></ul>"
						},
						{
							"module": "common-figure",
							"image": "images/explorations/theme-challenge/garden-style-tile.jpg",
							"figCaption": "Preliminary sketches of each module in a collage - no code yet!",
							"alt": "A wireframe website with a graphic diptych, an image next to text"
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Part 2: Making It</h2><p>The wireframe had six modules (sections): the masthead, graphic diptych, call-to-action (CTA), article grid, different CTA, and footer. The content was written into the HTML and the styling was responsive (element placement changed based on screen size).</p><p>I began with choosing typefaces, since typography dictates a large portion of the tone and shape of web design. After settling on elegant Cormorant for headings and accessible Source Sans 3 for body copy, I designated the voices and colors.</p><p>My thought process was to initially style the entire website, then perfect section by section. I discovered the delicate balance of meeting each section’s unique design needs while acknowledging the holistic “feel” of the sections working together.</p>"
						},
						{
							"module": "figure-list",
							"double-figure": true,
							"figure": [
								{
									"image": "images/explorations/theme-challenge/original-wireframe.jpg",
									"figCaption": "A wireframe with distinct sections",
									"alt": "A wireframe of a graphic diptych, an image next to text"
								},
								{
									"image": "images/explorations/theme-challenge/garden-settings-and-typography.jpg",
									"figCaption": "Setting custom properties allows for greater flexibility and readability.",
									"alt": "A code snippet of various typography rules"
								}
							]
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Header</h2><p>The main challenge of the heading was the layered logo text. I could have re-made the logo to be one line, but I liked the elegance of the ornate fern alongside the text. With this in mind, it made sense to create space. Contextually and functionally, the logo (company signifier) is separate from the “user-menu” (user-functions) on the right. The users eyes immediately jump from the thin logo to the bold, green button, so grouping navigation links there made sense from a UX perspective. Not only that, but many headers are smaller than we think. It wasn’t easy arriving at a layout…</p>"
						},
						{
							"module": "figure-list",
							"double-figure": true,
							"figure": [
								{
									"image": "images/explorations/theme-challenge/header-iteration.jpg",
									"figCaption": "Font-size, logo placement, svg flourishes, and JS functionality",
									"alt": "A graphics document showing variations of heading styles"
								},
								{
									"image": "images/explorations/theme-challenge/header-decisions.jpg",
									"figCaption": "Mapping out potential placements.",
									"alt": "A graphics document of heading elements in different arrangements"
								}
							]
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Graphic Diptych + CTA</h2><p>Most luxury websites have a large, immersive photograph or video with minimal text to grab the viewer’s attention. I chose a stately mansion with beautiful landscaping. Beneath, a short paragraph describing the services and mission statement of the company. The repeating leaf svg flourishes not only fill space, but allude to fleur-de-lis decorations on top of iron-wrought fences (fancy!). Ideally, I would have put the image in a separate section so it could span the entire width of the page (as of now, everything is in an “inner-column” container) but I did not want to alter the HTML too much.</p><p>The CTA had two versions. The first conveyed a more “retail” or “marketing” impression. Adding a black background-linear-gradient with slight opacity makes the text pop.</p>"
						},
						{
							"module": "common-figure",
							"image": "images/explorations/theme-challenge/garden-cta.jpg",
							"figCaption": "Slight differences in text size and spacing make a big difference, especially when you can’t always choose the final image!",
							"alt": "Two distinct CTA modules, one with a man handing a woman a plant, and another with a building surrouded by foilage."
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Article Grid</h2><p>For me, this was the most challenging part of the project. Almost all layouts on the internet are variations of boxes on a page, but making those boxes match a certain tone - and work together in a series - involves a lot of fine tuning. Setting grid and walking away will lead to many unintended layout shifts when screen sizes change.</p>"
						},
						{
							"module": "common-figure",
							"image": "images/explorations/theme-challenge/garden-grid-planning.jpg",
							"figCaption": "Exploring grid layout options",
							"alt": "Several different screens with potential grid layouts"
						},
						{
							"module": "generic-text-heading",
							"content": "<p>Ultimately, I decided on vertical slabs rather than landscape photos. I wanted the website to appear like a page from a magazine rather business-like list of services. I adjusted the spacing and line-height between the heading, description, and read more link (which I originally had as a button, but was too blocky and distracting) to feel like a print layout. I also had some trouble getting the link to stay at the bottom of the article container - I had to travel up through the html to the parent and set a border to see the problem. Eventually, I realized I had to add flex-grow: 1 to p so it would push the read more link to the bottom</p>"
						},
						{
							"module": "common-figure",
							"image": "images/explorations/theme-challenge/spacing-difficulty.jpg",
							"figCaption": "The p (blue-border) grows to push down the link to the bottom of the parent.",
							"alt": "Evenly spaced columns with arrows point to the 'read me' button at the buttom of each column"
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Footer & Site-Map</h2><p>I had to make a decision whether to have the links underlined or not. For clarity purposes, I prefer underlined links, but many of the luxury sites I researched had them on hover only. I added bullet point flourishes as well as pertinent information on the left-most menu, like contact information and the logo. I felt the terracotta color represented a planter and was fitting at the end fo the page (the content of the site growing out of a pot!). Of course, you can’t forget the social links…</p>"
						},
						{
							"module": "common-figure",
							"image": "images/explorations/theme-challenge/garden-final-footer.jpg",
							"figCaption": "Visited links appear in dark ink and the menus stack at smaller screen sizes.",
							"alt": "A site footer with four columns of links and social buttons"
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>PHP Structure</h2><p>While the focus of this project was visual design and the importance of establishing a consistent design system, actual content makes a website appear professional and complete. I also chose to practice routing and dynamic data insertion with PHP. I also wanted the user to be able to cycle between the wireframe and my styled version of the website.</p><p>The following photograph shows the “garden” page of the website that is inserted into the index. Based on the query string, a function readPageData checks that a json database exists for a specific page and decodes it (in this case, there’s only a “garden” or “default” page). The header and footer include - you guessed it - the header and footer templates. For the main section, I loop over an array of modules. The value of the “module” key will determine which template is pulled.</p>"
						},
						{
							"module": "common-figure",
							"image": "images/explorations/theme-challenge/garden-php.jpg",
							"figCaption": "The basic layout of each website page in PHP",
							"alt": "A code block showing how to loop over sections using dynamic data"
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Result</h2><p>Check out the <a href='featured-projects/theme-challenge'>styled project!</a>"
						}
					]
				},
				{
					"section": [
						{
							"module": "key-takeaways",
							"takeaways": [
								{
									"teaser": "Global classes help differentiate styles",
									"description": "<p>I can apply the different styles to each page by using that same <code>$page</code> variable to dynamically assign a class to the <code>html element</code>. That means every style preceded by <code>.garden</code> will be specific to the garden page, and every style preceded by <code>.default</code> will specific to the default page.</p>"
								}
							]
						}
					]
				}
			]
		},
		{
			"id": "4f07a236-71f8-44d3-9b93-5c5b8e8889f6",
			"title": "Caesar Cipher",
			"slug": "caesar-cipher",
			"published": "06 JUN 2024",
			"updated": "06 JUN 2024",
			"alt": "The letter 'A' and 'Z' in a roman-style door frame",
			"preview-image": "images/explorations/caesar-cipher/headline.jpg",
			"description": "Let's take a crack at some cryptography - with Javascript!",
			"related": ["theme-challenge", "bottles-in-the-sky"],
			"case-study": [
				{
					"section": [
						{
							"module": "common-figure",
							"image": "images/explorations/caesar-cipher/headline.jpg",
							"alt": "The letter 'A' and 'Z' in a roman-style door frame",
							"headline": true
						},
						{
							"module": "generic-text-heading",
							"content": "<h2>Introduction</h2><p>The other day I picked up The Code Book by <a href='https://simonsingh.net/'>Simon Singh</a>, a fascinating survey of the history of cryptography. The book “call(s) upon stories of political intrigue and tales of life and death” that serve as “turning points in the evolutionary development of codes,” to quote Singh himself.</p><p>Aside from being a history hobbyist, I’ve always been intrigued by codebreaking games like <a href='https://en.wikipedia.org/wiki/Mastermind_(board_game)'>Mastermind</a>, <a href='https://www.nytimes.com/games/wordle/index.html'>Wordle</a>, or those fun elementary school <a href='https://www.superteacherworksheets.com/secret-code-math.html'>math worksheets</a> where a “hidden message” is revealed through solving problems (each solution associated with a letter from the alphabet).</p><p>Now that I’m balancing out design with practicing algorithms, I thought it would be fun to attempt to “recreate” some of these ciphers in code, specifically using Vue. This would be a good chance to practice array manipulation techniques like <code>.map()</code> and <code>.indexOf()</code>.</p>"
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>The Cipher</h2><p>To be a good politician, you need to be obsessed with secrecy. Julius Caesar was no different - he used to encrypt his messages in a substitution cipher with a twist, the letters would be shifted a certain interval. In my cipher, I decided to shift the letters by 3, so “hello” would equal “khoor.”</p>"
						},
						{
							"module": "codepen",
							"pen": "<iframe height='450' style='width: 100%;' scrolling='no' title='caesar-cipher' src='https://codepen.io/Jeremy-Fishman/embed/LYoLLVe?default-tab=result&editable=true' frameborder='no' loading='lazy' allowtransparency='true' allowfullscreen='true'>See the Pen <a href='https://codepen.io/Jeremy-Fishman/pen/LYoLLVe'>caesar-cipher</a> by Jeremy Fishman (<a href='https://codepen.io/Jeremy-Fishman'>@Jeremy-Fishman</a>)on <a href='https://codepen.io'>CodePen</a>.</iframe>"
						},
						{
							"module": "generic-text-heading",
							"content": "<p>Some problems I did not foresee: looping back around the alphabet.</p><p>To compare the alphabet list and the input word, you need to figure out “how do I convert the word into where it falls in the alphabet?” You use indexes, it’s “slot” in the list - like saying “d” is the “4th” letter of the alphabet (the 4 would be the index). You can find this out by “for each of these letters, return the index where they fall on the alphabet list.”</p><p>However, the problem comes when you apply the shift. Let’s shift 3 letters. If “d” is the 4th letter, bring me back the 7th letter “g.” No issue yet. But when we get to “x”, “y”, and “z” … we’re going beyond the scope of our list, to 26, 27, 28 respectively. 26 is outside of the items because javascript starts counting indexes at 0, but counts length as the number of items. There are 25 indexes (z is 25), but the list is 26 items long. After some headscratching and research, the solution was to use a modulo operator (shows the remainder of a number). So 26 % 26 would be 0, which would access the first element of the array (the “a”); 27 % 26 would be 1, or “b”; and 28 % 26 would be 2, or “c”.</p><p>Here is some fun trivia to end on. According to wikipedia, substitution cipher where you swap a letter with its 13th letter has a special name - ROT13 - which “was used in online forums as a means of hiding spoilers, punchlines, puzzle solutions, and offensive material from the casual glance.”</p>"
						}	
					]
				}
			]
		},
		{
			"id": "eef3c6f4-43a8-45f7-b5c6-493a87b2756b",
			"title": "Teapet Shop",
			"slug": "teapet-shop",
			"published":"22 APR 2024",
			"updated": "24 APR 2024",
			"alt": "A lucky cat in the middle of two steaming teapots",
			"preview-image": "images/explorations/teapet-store/headline.jpg",
			"description": "Making a mock storefront selling teapets to keep you company - using CRUD methods.",
			"related": ["caesar-cipher", "theme-challenge"],
			"case-study": [
				{
					"section": [
						{
							"module": "common-figure",
							"image": "images/explorations/teapet-store/headline.jpg",
							"alt": "A lucky cat in the middle of two steaming teapots",
							"headline": true
						},
						{
							"module": "generic-text-heading",
							"content":"<h2>Introduction</h2><p>The goal of this project was to make a website with CRUD functionality using PHP. The website features a simple routing system using URL query strings, a UX friendly form for user input, and detail pages for each item. There are also functions that handle encoding PHP associative arrays into JSON (and decoding as needed). I chose to make a store where a user can purchase tea pets or customize their own, since steeping and enjoying different types of teas is a passion of mine."
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Create, Read, Update</h2><p>The creation aspect begins at the Customize page. Users will encounter a form, where they will customize the name, type, origin, material, and size. I thought it best to use select (dropdown) elements, as it reduces chance of typos (plus it is whatever we have in stock). If any fields are blank, warning messages will appear.</p>"
						},
						{
							"module": "common-figure",
							"image": "images/explorations/teapet-store/validation-form.jpg",
							"figCaption": "Form validation if required input is empty",
							"alt": "Two website forms for submitted order details for a custom teapet"
						},
						{
							"module": "generic-text-heading",
							"content": "<p>Once the user clicks submit, the PHP associate array (list of values) is stored in a variable (in this case, $customTeapet). We want to add this new information to the database, so first we need to <strong>read</strong> the data. We then add $customTeapet to the end of that list to <strong>update</strong> it. The updated list is then encoded into JSON (<strong>created / saved</strong>). When we go to the list page, we will see the new entry.</p>"
						},
						{
							"module": "common-figure",
							"image": "images/explorations/teapet-store/teapet-list-page.jpg",
							"figCaption": "A list of premade teapets along with the new custom teapet",
							"alt": "pictures of a buddha, frog, and cat teapet with price listings underneath."
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Delete</h2><p>All is well and good, but what if you want to learn more information about a tea pet? What if you had a change of heart and want to delete your creation? If you click on the card, you will be brought to a details page that has more information as well as a short description.</p>"
						},
						{
							"module": "common-figure",
							"image": "images/explorations/teapet-store/teapet-detail.jpg",
							"figCaption": "The delete button needs some work!",
							"alt": "A picture of a buddha teapet on a stone slab with price listing underneath"
						},
						{
							"module": "generic-text-heading",
							"content": "<p>The server knows which HTML page to render by looking at the data in the URL query string. For the Buddha, it sees index.php?page=detail&tea-pet=Buddha. Every tea pet has a unique id.</p><p>The delete button is actually a small form. Once input is submitted to the server, it loops over each item in the list. The loop is trying to find the ids that <em>don't</em> match the id in the URL query string to store them in a separate list (a sort of ‘do not delete me’ list). Those tea pets are pushed to the database, leaving the Buddha Teapet to seek Enlightenment elsewhere.</p>"
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>Result</h2><p>Check out the <a href='featured-projects/teapet'>styled project!</a>"
						}
					]
				},
				{
					"section": [
						{
							"module": "key-takeaways",
							"takeaways": [
								{
									"teaser": "You can follow CRUD tutorials and copy functions, but...",
									"description": "It's sometimes more useful to build on what you know (in this case, adding and removing data from arrays) to create more complex functions. This will give you a deeper understanding how these programs tick."
								},
								{
									"teaser": "Managing data is half the battle",
									"description": "To avoid pulling in the database information on every page, you can pull in the database information once at a larger scope. You can then sprinkle the data throughout smaller scopes as needed."
								}
							]
						}
					]
				}
			]
		},
		{
			"id": "85ee9f83-8e39-47ca-bfe2-abfe0e02ba5d",
			"title": "Find-A-Guide",
			"slug": "find-a-guide",
			"published": "11 JUN 2024",
			"updated": "11 JUN 2024",
			"alt": "Symbols of binoculars, a globe, and a walking person",
			"preview-image": "images/explorations/find-a-guide/headline.jpg",
			"description": "One week sprint to design and code a vanilla JS prototype",
			"related": ["theme-challenge", "teapet-shop"],
			"case-study": [
				{
					"section": [
						{
							"module": "common-figure",
							"image": "images/explorations/find-a-guide/headline.jpg",
							"alt": "Symbols of binoculars, a globe, and a walking person",
							"headline": true
						},
						{
							"module": "generic-text-heading",
							"content": "<h2>Introduction</h2><p>The past week, I spent six days brainstorming, researching, sketching, writing, and testing a design for a javascript web application. Even though I engaged with this process when designing my website, I enjoyed it much more. Perhaps it was because I set clearer goals and tossed my perfectionist tendencies in the dustbin. Or maybe, having done it before, I felt more confident recognizing stumbling blocks.</p><p>The main requirement of this sprint was to create something more complex than a single page, but not something unachievable in two weeks. The app should be browser-based, meaning I will primarily be using Javascript to render each page and manipulate the data dynamically</p><p>Before this, to use an auto-mechanic metaphor, I’d been tinkering with the brake system, the engine, the ignition separately. Now, I’d need to put everything together to make a functioning vehicle. It probably won’t be the most efficient, stylish, or environmentally friendly, but come hell or high water, it will move!</p><p>But way before reviewing arrays or common functions, the key to success was design.</p>"
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>The Plan</h2><p>I wanted to showcase an app that related to my career goals and interests, so I chose to create an app that helps travelers find the perfect local tour guide for their dream vacation, where the focus would be cultural and linguistic immersion. I’ve seen luxury customizable tours pop up recently, but what about the ability to find yourself in a city, hop on to an app, and get a tour designed by a local with your interests in mind? Wouldn’t it be cool if those guides had education degrees or finessed their tours for language learning experiences in mind? Wouldn’t it be cool if those guides had education degrees or finessed their tours for language learning experiences in mind?</p><p>What if it turned into a lifelong friendship? Or potential romance?</p><p>Of course, things like this <a href='https://www.toursbylocals.com/' target='_blank'>already exist</a>, and other <a href='https://www.airbnb.com/' target='_blank'>massively popular apps</a> offer <a href='https://www.couchsurfing.com/' target='_blank'>similar services</a>.</p><p>But that’s great! If the idea sucked, nobody would have tried it!</p>"
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>The Design</h2><p>First, I had to come up with user goals, the tasks involved, what could go wrong, and the scope of the app. I collected my thoughts in <a href='https://docs.google.com/document/d/1w7Piu5a_QkAmjlFWlU3kErWByOOC_q8LGFbyO4qZulk/edit#heading=h.sgjgnm3v66qh' target='_blank'>this document</a>.</p><p>Once those were established, I planned out my content model data points. Each tour would need a name, price, and associated tour guide. Each tour guide would need to have their location, mastered languages, area of expertise, photo, preferred pronouns/titles, etc…</p><p>After that, I used a <a href='https://www.mermaidchart.com/raw/7e4a5398-8c41-42a2-8794-6edb18d0e273?theme=light&version=v0.1&format=svg' target='_blank'>mermaid chart</a> to plan out the user flow.</p><p>Finally, I moved to the visual design; I planned out each page in <a href='https://www.figma.com/design/Hsc9H4KRy5Dwf2H4XLxHIk/Find-A-Guide-JS-Prototype?node-id=0-1&t=ZUg2y8dDThtPplKW-0' target='_blank'>Figma</a> with basic ('passable') styling."
						}
					]
				},
				{
					"section": [
						{
							"module": "generic-text-heading",
							"content": "<h2>The Code</h2><p>The first problem I encountered was - where to start? Should you go through each page 100% style and features, or should you get the skeleton of the navgiation down? According to Derek, it might make sense to start with the hardest thing - because that might create the longest blocker. Imagine reaching the end of the sprint and then beginning the toughest challenge when you are tired and just want to eat peanut m&ms and take a long shower.</p><p>Handling navigation meant saving state somewhere (aka, where you are). Every time a page rendered (gets painted on the screen), you had to save your state - or load your state! Reminded me of the fond days of emulating Super Nintendo games. It also meant creating a rudimentary router, that based on your state, a certain page would render.</p><p>After that got settled, I realized I needed to separate my functions. There are functions that handle computations, functions that handled the rendering, functions that grab or store date, and overall ‘structual’ functions that handled the other functions! I also encountered the joy of managing lots of imports and exports between files (which apparently is what happens in frameworks).</p>"
						}
					]
				}
			]
		}
	]
}